In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame()

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[1,2,3,4], [5,6,7,8], [9,10,11,12],[5,6,7,8], [9,10,11,12]])
print(df1)

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
3  5   6   7   8
4  9  10  11  12

In [6]:
df1.head(3)

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [7]:
df1.tail(4)

   0   1   2   3
1  5   6   7   8
2  9  10  11  12
3  5   6   7   8
4  9  10  11  12

# 9 tutorial

In [8]:
df1.shape

(5, 4)

In [9]:
df1.iloc[2,1]

10

In [10]:
df1.iloc[0:2,1:3]

   1  2
0  2  3
1  6  7

# Making Columns

In [11]:
df2 = pd.DataFrame([[1,2,3,4], [5,6,7,8], [9,10,11,12],[5,6,7,8], [9,10,11,12]], columns=['A', 'B', 'C', 'D'])
print(df2)

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
3  5   6   7   8
4  9  10  11  12

In [12]:
df2.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
df2.describe()

             A         B         C         D
count  5.00000   5.00000   5.00000   5.00000
mean   5.80000   6.80000   7.80000   8.80000
std    3.34664   3.34664   3.34664   3.34664
min    1.00000   2.00000   3.00000   4.00000
25%    5.00000   6.00000   7.00000   8.00000
50%    5.00000   6.00000   7.00000   8.00000
75%    9.00000  10.00000  11.00000  12.00000
max    9.00000  10.00000  11.00000  12.00000

In [14]:
df2.head

<bound method NDFrame.head of    A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
3  5   6   7   8
4  9  10  11  12>

In [15]:
df2.T

   0  1   2  3   4
A  1  5   9  5   9
B  2  6  10  6  10
C  3  7  11  7  11
D  4  8  12  8  12

In [16]:
df2['A']

0    1
1    5
2    9
3    5
4    9
Name: A, dtype: int64

# working with csv

In [17]:
csv = pd.read_excel('panda.xls')

In [18]:
csv

     Name       Date  Earning
0  Naitik 2020-05-26       10
1   Pawan 2020-05-26       50
2    Mini 2020-05-26       90
3    Renu 2020-05-26      130
4   Kavya 2020-05-26      170

In [33]:
data=pd.read_csv('data.csv')

In [34]:
data

    SYMBOL SERIES  LOW_PRICE     NAME
0    23.00     EO        506      RDX
1    52.00     EO        600  MINERAL
2    86.00     EO        694      RDX
3   116.67     EO        788  MINERAL
4   148.17     EO        882      RDX
5   179.67     EO        976  MINERAL
6   211.17     EO       1070      RDX
7   242.67     EO       1164  MINERAL
8   274.17     EO       1258      RDX
9   305.67     EO       1352  MINERAL
10  337.17     EO       1446      RDX
11  368.67     EO       1540  MINERAL
12  400.17     EO       1634      RDX
13  431.67     EO       1728  MINERAL
14  463.17     EO       1822      RDX
15  494.67     EO       1916  MINERAL
16  526.17     EO       2010      RDX
17  557.67     EO       2104  MINERAL
18  589.17     EO       2198      RDX
19  620.67     EO       2292  MINERAL
20  652.17     EO       2386      RDX

In [21]:
data.head()

   SYMBOL SERIES  LOW_PRICE     NAME
0   23.00     EO        506      RDX
1   52.00     EO        600  MINERAL
2   86.00     EO        694      RDX
3  116.67     EO        788  MINERAL
4  148.17     EO        882      RDX

In [22]:
print(data['SYMBOL'].dtype)

float64

In [23]:
print(data['SYMBOL'].astype('category'))

0      23.00
1      52.00
2      86.00
3     116.67
4     148.17
5     179.67
6     211.17
7     242.67
8     274.17
9     305.67
10    337.17
11    368.67
12    400.17
13    431.67
14    463.17
15    494.67
16    526.17
17    557.67
18    589.17
19    620.67
20    652.17
Name: SYMBOL, dtype: category
Categories (21, float64): [23.00, 52.00, 86.00, 116.67, ..., 557.67, 589.17, 620.67, 652.17]

# export file to csv

In [24]:
df2

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
3  5   6   7   8
4  9  10  11  12

In [25]:
df2.to_csv('export.csv' )# ,index=false) toprevent data

In [26]:
# to merge data

In [27]:
df1

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
3  5   6   7   8
4  9  10  11  12

In [28]:
df3 = pd.DataFrame([[1,2,3,4], [5,62,71,81], [9,10,11,12],[5,61,71,81], [9,101,111,121]], columns=['A', 'B', 'C', 'D'])
print(df2)

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12
3  5   6   7   8
4  9  10  11  12

In [29]:
df4=pd.merge(df3, df2, right_on="A", left_on='A')

In [30]:
df4

   A  B_x  C_x  D_x  B_y  C_y  D_y
0  1    2    3    4    2    3    4
1  5   62   71   81    6    7    8
2  5   62   71   81    6    7    8
3  5   61   71   81    6    7    8
4  5   61   71   81    6    7    8
5  9   10   11   12   10   11   12
6  9   10   11   12   10   11   12
7  9  101  111  121   10   11   12
8  9  101  111  121   10   11   12